blog-posts/2005-09-16-geekwear.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Geekwear</title>
<!-- 2015-01-07 Wed 14:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Geekwear</h1>
<p>
September 16th, 2005 -
<a href="http://sachachua.com/blog/p/2981"><a href="http://sachachua.com/blog/p/2981">http://sachachua.com/blog/p/2981</a></a>
</p>

<p>
I actually like wearing geek swag: clothes and accessories with a
 logo or geek reference. Geek swag identifies me to other geeks and
 makes it easier for geeks of similar interests to start conversations
 with me. <a href="http://sachachua.com/notebook/wiki/2005.07.06#2">I'm not the
only one who thinks so.</a>
</p>

<p>
I want geek swag, but I want geek swag that fits my lifestyle.
</p>

<ul class="org-ul">
<li>I occasionally wear T-shirts. My Linux conference baby tee is
</li>
</ul>

<blockquote>
<p>
much-loved and often-worn.
</p>
</blockquote>

<ul class="org-ul">
<li>I really want some kind of geek bag, but I also want my
</li>
</ul>

<blockquote>
<p>
multi-compartment tote with all sorts of nifty pockets.
</p>
</blockquote>

<ul class="org-ul">
<li>I want a geek sweater or hoodie that I can wear more often than a
</li>
</ul>
<p>
T-shirt.
</p>

<ul class="org-ul">
<li>I want geek earrings. (Anyone who makes pretty Tux earrings for a
</li>
</ul>

<blockquote>
<p>
reasonable price will have my business.)
</p>
</blockquote>

<ul class="org-ul">
<li>I want an index card holder with a pen loop. This is more for my
</li>
</ul>

<blockquote>
<p>
D*I*Y Planner geekiness.
</p>
</blockquote>

<ul class="org-ul">
<li>I want stickers. My current sticker reads “The geek shall inherit
</li>
</ul>

<blockquote>
<p>
the earth.” It's bright red and white, and can't help but draw
 attention to my ubercute-and-small laptop.
</p>
</blockquote>

<ul class="org-ul">
<li>I want a D*I*Y 1″ or 1.5″ zippered binder, just because. Yes, I have
</li>
</ul>

<blockquote>
<p>
far too many binders already. That doesn't stop me from wanting a
 D*I*Y Planner one.
</p>
</blockquote>

<p>
Okay. Let's see. I can focus on making either a geek hoodie or a geek
 bag, and then move on from there.
</p>

<p>
Hmmmm.
</p>

<p>
I know people who have silkscreened stuff.
</p>

<p>
Heck, I stenciled a shirt in grade school. And it turned out quite
 good, too.
</p>

<p>
I should be able to do it again, but this time, cooler.
</p>

<p>
I should learn how to silkscreen. That'll probably be easier once I
figure out how to get frames sorted out&#x2026;
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
